In [24]:
import pandas as pd

In [26]:
df = pd.read_csv('data/test.csv')
df

               Name  Age         City  Total     Sex  Graduate
0   Prosenjit Sinha   43    Manalapan    860    Male      True
1    Priyasha Sinha   16  Englishtown    900  Female      True
2  Priyankana Dutta   41    Manalapan   1000    Male     False
3      Prayan Sinha    8        Ocean   1200  Female     False

In [28]:
df.groupby('City').sum()

                                        Name  Age  Total       Sex  Graduate
City
Englishtown                   Priyasha Sinha   16    900    Female         1
Manalapan    Prosenjit SinhaPriyankana Dutta   84   1860  MaleMale         1
Ocean                           Prayan Sinha    8   1200    Female         0

In [30]:
df[['Name', 'Age']]

               Name  Age
0   Prosenjit Sinha   43
1    Priyasha Sinha   16
2  Priyankana Dutta   41
3      Prayan Sinha    8

In [32]:
df[:2]

              Name  Age         City  Total     Sex  Graduate
0  Prosenjit Sinha   43    Manalapan    860    Male      True
1   Priyasha Sinha   16  Englishtown    900  Female      True

In [36]:
df[1:2]

             Name  Age         City  Total     Sex  Graduate
1  Priyasha Sinha   16  Englishtown    900  Female      True